In [1]:
import pandas as pd
import numpy as np

In [2]:
date = pd.read_csv("C:\\Users\\ANKAN KUMAR SAHOO\\Downloads\\orders.csv")
time = pd.read_csv("C:\\Users\\ANKAN KUMAR SAHOO\\Downloads\\messages.csv")

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [5]:
date['date'] = pd.to_datetime(date['date'])

In [6]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [7]:
date['date_year'] = date['date'].dt.year

In [8]:
date['date_month_no'] = date['date'].dt.month

In [9]:
date['date_month_name'] = date['date'].dt.month_name()

In [10]:
date['date_day'] = date['date'].dt.day

In [11]:
date['day_of_week'] = date['date'].dt.dayofweek

In [12]:
date['date_of_week_name'] = date['date'].dt.day_name()

In [17]:
date['quarter'] = date['date'].dt.quarter

In [19]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,day_of_week,date_of_week_name,quarter
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,4
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,3
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,4
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,3
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1